---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.MinTreadDepth
source: html/a79f1cad-d339-1636-8025-d306e0deed9a.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.MinTreadDepth Property

The minimum tread width along the center path for all common runs (winder, arc, and straight).

## Syntax (C#)
```csharp
public double MinTreadDepth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for minTreadDepth must be greater than 0 and no more than 30000 feet.